tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
brew "node"
brew "openssl@1.1"
brew "bower"
brew "ghc"
brew "cabal-install"
brew "gcc@6"
brew "hpack"
brew "krb5"
brew "libevent"
brew "libfido2"
brew "mysql", restart_service: true
brew "mysql-client"
brew "postgresql@14", restart_service: true
brew "python@3.11", link: false
brew "redis", restart_service: true
brew "rustup-init"
cask "ngrok"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "GitHub.remotehub"
vscode "haskell.haskell"
vscode "justusadam.language-haskell"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "PKief.material-icon-theme"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "shardulm94.trailing-spaces"
vscode "tamasfe.even-better-toml"
vscode "waderyan.gitblame"
